# Pandas
## Series
### Basics

In [1]:
import numpy as np
import pandas as pd

In [3]:
lst = [i**2 for i in range(10)]
lst

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [4]:
type(lst)

list

In [5]:
pd_series = pd.Series(lst)
pd_series

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int64

In [6]:
type(pd_series)

pandas.core.series.Series

In [7]:
lst[5]

25

In [8]:
pd_series[5]

25

In [11]:
number_names = ["zero", "one", "two", "three", "four", "five", "six", "seven", "eight", "nine"]

In [14]:
named_series = pd.Series(lst, number_names)
named_series

zero      0
one       1
two       4
three     9
four     16
five     25
six      36
seven    49
eight    64
nine     81
dtype: int64

In [15]:
named_series["five"]

25

In [16]:
named_series[5]

25

In [18]:
np_arr = np.arange(0,9,2)
np_arr

array([0, 2, 4, 6, 8])

In [19]:
pd.Series(np_arr)

0    0
1    2
2    4
3    6
4    8
dtype: int64

In [20]:
dictionary = {"a":1, "b":2, "c":3}
dictionary

{'a': 1, 'b': 2, 'c': 3}

In [23]:
dict_series = pd.Series(dictionary)
dict_series

a    1
b    2
c    3
dtype: int64

In [24]:
dict_series["a"]

1

In [25]:
dictionary["a"]

1

### Calculations

In [26]:
#import numpy as np
#import pandas as pd

In [27]:
basket_1 = {"apples":3, "pears":2, "bananas":1}
basket_2 = {"apples":5, "bananas":2, "grapes":10}

In [28]:
basket_series1 = pd.Series(basket_1)
basket_series2 = pd.Series(basket_2)

In [30]:
basket_series1

apples     3
pears      2
bananas    1
dtype: int64

In [31]:
basket_series1 + basket_series2

apples     8.0
bananas    3.0
grapes     NaN
pears      NaN
dtype: float64

In [33]:
basket_3 = {"apples":3, "pears":2, "bananas":1, "grapes":100}
basket_4 = {"apples":5, "bananas":2, "grapes":10, "pears":4}

In [34]:
basket_series3 = pd.Series(basket_3)
basket_series4 = pd.Series(basket_4)

In [35]:
basket_series3 + basket_series4

apples       8
bananas      3
grapes     110
pears        6
dtype: int64

## DataFrames

### Creating a random DataFrame (data is synthetic!)

In [37]:
cols = ["Cars", "Bicycles", "Scooter", "Powerplants", "Flower"]
rows = ["Germany", "China", "France", "USA", "Iceland"]

In [38]:
data = np.random.randint(1, 1000000, (len(rows), len(cols)))
data

array([[149455, 843869, 817887, 256802, 804946],
       [993542, 952183,   1729, 376470, 611754],
       [488843, 957826, 897808, 748764,  20518],
       [199580, 309767, 734203, 134947,  56205],
       [  7767, 163751, 126818, 162259, 928317]])

In [39]:
countries_df = pd.DataFrame(data, index=rows, columns=cols)
countries_df

           Cars  Bicycles  Scooter  Powerplants  Flower
Germany  149455    843869   817887       256802  804946
China    993542    952183     1729       376470  611754
France   488843    957826   897808       748764   20518
USA      199580    309767   734203       134947   56205
Iceland    7767    163751   126818       162259  928317

### Accessing values

In [40]:
countries_df["Cars"]

Germany    149455
China      993542
France     488843
USA        199580
Iceland      7767
Name: Cars, dtype: int64

In [41]:
type(countries_df["Cars"])

pandas.core.series.Series

In [42]:
countries_df["Cars"]["Germany"]

149455

In [44]:
countries_df[["Cars", "Bicycles"]]

           Cars  Bicycles
Germany  149455    843869
China    993542    952183
France   488843    957826
USA      199580    309767
Iceland    7767    163751

In [45]:
countries_df[["Cars"]]

           Cars
Germany  149455
China    993542
France   488843
USA      199580
Iceland    7767

In [48]:
countries_df[["Cars"]]["Germany"]

KeyError: 'Germany'

In [49]:
countries_df.loc["Germany"]

Cars           149455
Bicycles       843869
Scooter        817887
Powerplants    256802
Flower         804946
Name: Germany, dtype: int64

In [50]:
type(countries_df.loc["Germany"])

pandas.core.series.Series

In [51]:
countries_df.loc["Germany"]["Cars"]

149455

In [52]:
countries_df.loc[["Germany", "China"]]

           Cars  Bicycles  Scooter  Powerplants  Flower
Germany  149455    843869   817887       256802  804946
China    993542    952183     1729       376470  611754

In [53]:
countries_df.loc[["France"]]

          Cars  Bicycles  Scooter  Powerplants  Flower
France  488843    957826   897808       748764   20518

In [54]:
countries_df.loc[["France"]]["Scooter"]

France    897808
Name: Scooter, dtype: int64

In [55]:
countries_df.loc["France"]["Scooter"]

897808

In [56]:
countries_df

           Cars  Bicycles  Scooter  Powerplants  Flower
Germany  149455    843869   817887       256802  804946
China    993542    952183     1729       376470  611754
France   488843    957826   897808       748764   20518
USA      199580    309767   734203       134947   56205
Iceland    7767    163751   126818       162259  928317

In [57]:
countries_df["Bicycles"]["Germany"] = 80000

In [58]:
countries_df

           Cars  Bicycles  Scooter  Powerplants  Flower
Germany  149455     80000   817887       256802  804946
China    993542    952183     1729       376470  611754
France   488843    957826   897808       748764   20518
USA      199580    309767   734203       134947   56205
Iceland    7767    163751   126818       162259  928317

In [59]:
countries_df["Transportation"] = countries_df["Cars"] + countries_df["Bicycles"] + countries_df["Scooter"]

In [60]:
countries_df

           Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
Germany  149455     80000   817887       256802  804946         1047342
China    993542    952183     1729       376470  611754         1947454
France   488843    957826   897808       748764   20518         2344477
USA      199580    309767   734203       134947   56205         1243550
Iceland    7767    163751   126818       162259  928317          298336

In [61]:
countries_df["Random Thing"] = countries_df["Flower"] * countries_df["Powerplants"]

In [62]:
countries_df

,Cars,Bicycles,Scooter,Powerplants,Flower,Transportation,Random Thing
Germany,149455,80000,817887,256802,804946,1047342,206711742692
China,993542,952183,1729,376470,611754,1947454,230307028380
France,488843,957826,897808,748764,20518,2344477,15363139752
USA,199580,309767,734203,134947,56205,1243550,7584696135
Iceland,7767,163751,126818,162259,928317,298336,150627788103

### Deleting entries

In [66]:
countries_df.drop("Random Thing", axis=1)

           Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
Germany  149455     80000   817887       256802  804946         1047342
China    993542    952183     1729       376470  611754         1947454
France   488843    957826   897808       748764   20518         2344477
USA      199580    309767   734203       134947   56205         1243550
Iceland    7767    163751   126818       162259  928317          298336

In [67]:
countries_df

,Cars,Bicycles,Scooter,Powerplants,Flower,Transportation,Random Thing
Germany,149455,80000,817887,256802,804946,1047342,206711742692
China,993542,952183,1729,376470,611754,1947454,230307028380
France,488843,957826,897808,748764,20518,2344477,15363139752
USA,199580,309767,734203,134947,56205,1243550,7584696135
Iceland,7767,163751,126818,162259,928317,298336,150627788103

In [68]:
countries_df.drop("Random Thing", axis=1, inplace=True)

In [69]:
countries_df

           Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
Germany  149455     80000   817887       256802  804946         1047342
China    993542    952183     1729       376470  611754         1947454
France   488843    957826   897808       748764   20518         2344477
USA      199580    309767   734203       134947   56205         1243550
Iceland    7767    163751   126818       162259  928317          298336

### Advanced selecting

In [70]:
countries_df["Cars"] # what we did so far

Germany    149455
China      993542
France     488843
USA        199580
Iceland      7767
Name: Cars, dtype: int64

In [71]:
countries_df["Cars"] > 300000

Germany    False
China       True
France      True
USA        False
Iceland    False
Name: Cars, dtype: bool

In [72]:
countries_df[countries_df["Cars"] > 300000]

          Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
China   993542    952183     1729       376470  611754         1947454
France  488843    957826   897808       748764   20518         2344477

In [77]:
countries_df[(countries_df["Flower"] > 200000) & (countries_df["Powerplants"] > 200000)]

           Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
Germany  149455     80000   817887       256802  804946         1047342
China    993542    952183     1729       376470  611754         1947454

In [76]:
countries_df

           Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
Germany  149455     80000   817887       256802  804946         1047342
China    993542    952183     1729       376470  611754         1947454
France   488843    957826   897808       748764   20518         2344477
USA      199580    309767   734203       134947   56205         1243550
Iceland    7767    163751   126818       162259  928317          298336

### Working with the index

In [78]:
countries_df

           Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
Germany  149455     80000   817887       256802  804946         1047342
China    993542    952183     1729       376470  611754         1947454
France   488843    957826   897808       748764   20518         2344477
USA      199580    309767   734203       134947   56205         1243550
Iceland    7767    163751   126818       162259  928317          298336

In [79]:
countries_df.loc["Germany"]

Cars               149455
Bicycles            80000
Scooter            817887
Powerplants        256802
Flower             804946
Transportation    1047342
Name: Germany, dtype: int64

In [80]:
countries_df.reset_index(inplace=True)
countries_df

     index    Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
0  Germany  149455     80000   817887       256802  804946         1047342
1    China  993542    952183     1729       376470  611754         1947454
2   France  488843    957826   897808       748764   20518         2344477
3      USA  199580    309767   734203       134947   56205         1243550
4  Iceland    7767    163751   126818       162259  928317          298336

In [81]:
countries_df.rename({"index":"Country Name"}, axis=1, inplace=True)
countries_df

  Country Name    Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
0      Germany  149455     80000   817887       256802  804946         1047342
1        China  993542    952183     1729       376470  611754         1947454
2       France  488843    957826   897808       748764   20518         2344477
3          USA  199580    309767   734203       134947   56205         1243550
4      Iceland    7767    163751   126818       162259  928317          298336

## Multiple DataFrames

In [82]:
cols = ["Bananas", "Apples"]
rows = ["Germany", "USA", "China", "New Zealand"]
data = np.random.randint(1, 1000000, (len(rows), len(cols)))

In [83]:
countries_df2 = pd.DataFrame(data, columns=cols, index=rows)

In [84]:
countries_df2

             Bananas  Apples
Germany       677089  825939
USA           770048  482599
China         298410   45526
New Zealand   358926  572438

In [85]:
countries_df2 = countries_df2.reset_index().rename({"index":"Country Name"}, axis=1)

In [86]:
countries_df2

  Country Name  Bananas  Apples
0      Germany   677089  825939
1          USA   770048  482599
2        China   298410   45526
3  New Zealand   358926  572438

### Merge

In [87]:
pd.merge(countries_df, countries_df2, on="Country Name", how="inner")

,Country Name,Cars,Bicycles,Scooter,Powerplants,Flower,Transportation,Bananas,Apples
0,Germany,149455,80000,817887,256802,804946,1047342,677089,825939
1,China,993542,952183,1729,376470,611754,1947454,298410,45526
2,USA,199580,309767,734203,134947,56205,1243550,770048,482599

In [89]:
countries_outer_df = pd.merge(countries_df, countries_df2, on="Country Name", how="outer")
countries_outer_df

,Country Name,Cars,Bicycles,Scooter,Powerplants,Flower,Transportation,Bananas,Apples
0,Germany,149455.0,80000.0,817887.0,256802.0,804946.0,1047342.0,677089.0,825939.0
1,China,993542.0,952183.0,1729.0,376470.0,611754.0,1947454.0,298410.0,45526.0
2,France,488843.0,957826.0,897808.0,748764.0,20518.0,2344477.0,NaN,NaN
3,USA,199580.0,309767.0,734203.0,134947.0,56205.0,1243550.0,770048.0,482599.0
4,Iceland,7767.0,163751.0,126818.0,162259.0,928317.0,298336.0,NaN,NaN
5,New Zealand,NaN,NaN,NaN,NaN,NaN,NaN,358926.0,572438.0

In [90]:
countries_outer_df.mean() # NaN is helpful in calculating aggregate statistics!

Cars               367837.40
Bicycles           492705.40
Scooter            515689.00
Powerplants        335848.40
Flower             484348.00
Transportation    1376231.80
Bananas            526118.25
Apples             481625.50
dtype: float64

In [91]:
pd.merge(countries_df, countries_df2, on="Country Name", how="left")

,Country Name,Cars,Bicycles,Scooter,Powerplants,Flower,Transportation,Bananas,Apples
0,Germany,149455,80000,817887,256802,804946,1047342,677089.0,825939.0
1,China,993542,952183,1729,376470,611754,1947454,298410.0,45526.0
2,France,488843,957826,897808,748764,20518,2344477,NaN,NaN
3,USA,199580,309767,734203,134947,56205,1243550,770048.0,482599.0
4,Iceland,7767,163751,126818,162259,928317,298336,NaN,NaN

### Missing Data

In [94]:
countries_outer_df

,Country Name,Cars,Bicycles,Scooter,Powerplants,Flower,Transportation,Bananas,Apples
0,Germany,149455.0,80000.0,817887.0,256802.0,804946.0,1047342.0,677089.0,825939.0
1,China,993542.0,952183.0,1729.0,376470.0,611754.0,1947454.0,298410.0,45526.0
2,France,488843.0,957826.0,897808.0,748764.0,20518.0,2344477.0,NaN,NaN
3,USA,199580.0,309767.0,734203.0,134947.0,56205.0,1243550.0,770048.0,482599.0
4,Iceland,7767.0,163751.0,126818.0,162259.0,928317.0,298336.0,NaN,NaN
5,New Zealand,NaN,NaN,NaN,NaN,NaN,NaN,358926.0,572438.0

In [93]:
countries_outer_df.fillna(countries_outer_df.mean())

,Country Name,Cars,Bicycles,Scooter,Powerplants,Flower,Transportation,Bananas,Apples
0,Germany,149455.0,80000.0,817887.0,256802.0,804946.0,1047342.0,677089.00,825939.0
1,China,993542.0,952183.0,1729.0,376470.0,611754.0,1947454.0,298410.00,45526.0
2,France,488843.0,957826.0,897808.0,748764.0,20518.0,2344477.0,526118.25,481625.5
3,USA,199580.0,309767.0,734203.0,134947.0,56205.0,1243550.0,770048.00,482599.0
4,Iceland,7767.0,163751.0,126818.0,162259.0,928317.0,298336.0,526118.25,481625.5
5,New Zealand,367837.4,492705.4,515689.0,335848.4,484348.0,1376231.8,358926.00,572438.0

In [97]:
countries_outer_df.fillna(value={"Bananas":600000, "Apples":300000}).dropna()

,Country Name,Cars,Bicycles,Scooter,Powerplants,Flower,Transportation,Bananas,Apples
0,Germany,149455.0,80000.0,817887.0,256802.0,804946.0,1047342.0,677089.0,825939.0
1,China,993542.0,952183.0,1729.0,376470.0,611754.0,1947454.0,298410.0,45526.0
2,France,488843.0,957826.0,897808.0,748764.0,20518.0,2344477.0,600000.0,300000.0
3,USA,199580.0,309767.0,734203.0,134947.0,56205.0,1243550.0,770048.0,482599.0
4,Iceland,7767.0,163751.0,126818.0,162259.0,928317.0,298336.0,600000.0,300000.0

### Concatenation

In [98]:
countries_df

  Country Name    Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
0      Germany  149455     80000   817887       256802  804946         1047342
1        China  993542    952183     1729       376470  611754         1947454
2       France  488843    957826   897808       748764   20518         2344477
3          USA  199580    309767   734203       134947   56205         1243550
4      Iceland    7767    163751   126818       162259  928317          298336

In [102]:
cols = ["Country Name", "Cars", "Bicycles", "Scooter", "Powerplants", "Flower", "Transportation"]
rows = ["South Arica", "Argentina", "Chile", "Lybia"]

data = np.random.randint(1, 1000000, (len(rows), len(cols)))
data

countries_df_new = pd.DataFrame(data, columns=cols)

In [ ]:
countries_df_new["Country Name"] = rows

In [106]:
countries_df_new

  Country Name    Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
0  South Arica  124778    542630   664444       621310  693778          764564
1    Argentina  162210    108502   604893       100893  770069           86136
2        Chile  882039    345332   948100       606019  143886          343676
3        Lybia  222183    450582    86125       851091  940475          432131

In [110]:
countries_df_large = pd.concat([countries_df, countries_df_new]).reset_index(drop=True)
countries_df_large

  Country Name    Cars  Bicycles  Scooter  Powerplants  Flower  Transportation
0      Germany  149455     80000   817887       256802  804946         1047342
1        China  993542    952183     1729       376470  611754         1947454
2       France  488843    957826   897808       748764   20518         2344477
3          USA  199580    309767   734203       134947   56205         1243550
4      Iceland    7767    163751   126818       162259  928317          298336
5  South Arica  124778    542630   664444       621310  693778          764564
6    Argentina  162210    108502   604893       100893  770069           86136
7        Chile  882039    345332   948100       606019  143886          343676
8        Lybia  222183    450582    86125       851091  940475          432131

### GroupBy

In [111]:
countries_df_large["Continent"] = ["Europe", "Asia", "Europe", "North America", "Europe", "Africa", "South America", "South America", "Africa"]

In [112]:
countries_df_large

,Country Name,Cars,Bicycles,Scooter,Powerplants,Flower,Transportation,Continent
0,Germany,149455,80000,817887,256802,804946,1047342,Europe
1,China,993542,952183,1729,376470,611754,1947454,Asia
2,France,488843,957826,897808,748764,20518,2344477,Europe
3,USA,199580,309767,734203,134947,56205,1243550,North America
4,Iceland,7767,163751,126818,162259,928317,298336,Europe
5,South Arica,124778,542630,664444,621310,693778,764564,Africa
6,Argentina,162210,108502,604893,100893,770069,86136,South America
7,Chile,882039,345332,948100,606019,143886,343676,South America
8,Lybia,222183,450582,86125,851091,940475,432131,Africa

In [116]:
countries_df_large.groupby("Continent").mean()

,Cars,Bicycles,Scooter,Powerplants,Flower,Transportation
Continent,,,,,,
Africa,173480.5,496606.000000,375284.5,736200.5,817126.500000,5.983475e+05
Asia,993542.0,952183.000000,1729.0,376470.0,611754.000000,1.947454e+06
Europe,215355.0,400525.666667,614171.0,389275.0,584593.666667,1.230052e+06
North America,199580.0,309767.000000,734203.0,134947.0,56205.000000,1.243550e+06
South America,522124.5,226917.000000,776496.5,353456.0,456977.500000,2.149060e+05

## Read Data

In [117]:
iris_df = pd.read_csv("data/IRIS.csv")

In [118]:
iris_df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [121]:
iris_df.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [122]:
iris_df.tail(5)

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [123]:
iris_df.sample(5)

     sepal_length  sepal_width  petal_length  petal_width     species
19            5.1          3.8           1.5          0.3      setosa
146           6.3          2.5           5.0          1.9   virginica
57            4.9          2.4           3.3          1.0  versicolor
97            6.2          2.9           4.3          1.3  versicolor
105           7.6          3.0           6.6          2.1   virginica

In [124]:
iris_df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [125]:
iris_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [128]:
sepal_df = iris_df[["sepal_length", "sepal_width", "species"]]

In [130]:
#iris_df.drop(["petal_width", "petal_length"], axis=1) # does the same

In [131]:
sepal_df.to_csv("data/SEPAL.csv")

In [137]:
sepal_read_df = pd.read_csv("data/SEPAL.csv", index_col=0, delimiter=",")

In [138]:
sepal_read_df

     sepal_length  sepal_width    species
0             5.1          3.5     setosa
1             4.9          3.0     setosa
2             4.7          3.2     setosa
3             4.6          3.1     setosa
4             5.0          3.6     setosa
..            ...          ...        ...
145           6.7          3.0  virginica
146           6.3          2.5  virginica
147           6.5          3.0  virginica
148           6.2          3.4  virginica
149           5.9          3.0  virginica

[150 rows x 3 columns]